# Итераторы
## Contents

1. [Слияние](#слияние)
2. [Коммутативная функция](#коммутативная-функция)
3. [Прочти это вслух](#прочти-это-вслух)
4. [Знаки Пи](#знак-пи)

## Слияние
Файл - ```day07_task01.py```

Написать генератор-функцию joinseq(seq0, seq1, …), принимающую на вход произвольное количество (возможно, бесконечных) последовательностей. Порождаемый ею генератор должен всякий раз возвращать наименьший из начальных элементов этих последовательностей. Если таких несколько, используется самый первый. Если последовательность закончилась, она больше не учитывается. Итератор завершается, когда все последовательности иссякли. Условие: использовать обработку исключений в этой задаче нельзя.

### Примеры

Входные данные

```
print("".join(joinseq("abs", "qr", "azt")))
```

Результат работы

```
aabqrszt
```

## Коммутативная функция
Файл - ```day07_task02.py```

Написать функцию checkcomm(fun, *args), которой передаётся не менее одного параметра. Параметр fun — это некоторая n-местная функция, где n — это длина args. checkcomm() должна возвращать True, если функция fun() на заданных параметрах коммутативна, то есть в каком бы порядке они ей не передавались, результат одинаков, и False в противном случае. Гарантируется, что во всех случаях функция вычислима.

### Примеры

Входные данные
```
print(checkcomm(max, 1, 9, 2, 7, 3, 6))
```
Результат работы
```
True
```

## Прочти это вслух
Файл - ```day07_task03.py```

Написать генератор-функцию LookSay() цифр последовательности Конвея «Look and Say». Сама последовательность должна быть целочисленной. Описание в Википедии

### Примеры

Входные данные
```
for i, l in enumerate(LookSay()):
    print(f"{i}: {l}")
    if i > 10:
        break
```
Результат работы
```
0: 1
1: 1
2: 1
3: 2
4: 1
5: 1
6: 2
7: 1
8: 1
9: 1
10: 1
11: 1
```

## Знаки Пи
Файл - ```day07_task01.py```

Написать генератор-функцию PiGen(), которая будет возвращать односимвольные строки — знаки числа Пи (включая 3 и точку). Первая тысяча таких знаков должна быть точной. Дополнительные требования: Нельзя заранее задавать в виде константы само число Пи (по ссылке оно есть ☺) или иные данные с точностью более 20 знаков Нельзя вычислять всю тысячу знаков заранее, а потом выдавать их — не пройдут тесты по времени

### Примеры

Входные данные
```
print(*(c[0] for c in zip(PiGen(), range(30))))
```
Результат работы
```
3 . 1 4 1 5 9 2 6 5 3 5 8 9 7 9 3 2 3 8 4 6 2 6 4 3 3 8 3 2
```
